full_dict = {
    1: {
        'film': 'Железный человек',
        'year': 2008,
        'director': 'Джон Фавро',
        'screenwriter': 'Марк Фергус и Хоук Остби, Артур Маркам и Мэтт Холлоуэй',
        'producer': 'Ави Арад и Кевин Файги',
        'phase': 'Первая фаза'
    },
    2: {
        'film': 'Невероятный Халк',
        'year': 2008,
        'director': 'Луи Летерье',
        'screenwriter': 'Зак Пенн',
        'producer': 'Ави Арад, Гейл Энн Хёрд и Кевин Файги',
        'phase': 'Первая фаза'
    },
    3: {
        'film': 'Железный человек 2',
        'year': 2010,
        'director': 'Джон Фавро',
        'screenwriter': 'Джастин Теру',
        'producer': 'Кевин Файги',
        'phase': 'Первая фаза'
    },
    4: {
        'film': 'Тор',
        'year': 2011,
        'director': 'Кеннет Брана',
        'screenwriter': 'Эшли Эдвард Миллер и Зак Стенц, Дон Пейн',
        'producer': 'Нет данных',
        'phase': 'Первая фаза'
    },
    5: {
        'film': 'Первый мститель',
        'year': 2011,
        'director': 'Джо Джонстон',
        'screenwriter': 'Кристофер Маркус и Стивен Макфили',
        'producer': 'Нет данных',
        'phase': 'Первая фаза'
    },
    6: {
        'film': 'Мстители',
        'year': 2012,
        'director': 'Джосс Уидон',
        'screenwriter': 'Нет данных',
        'producer': 'Нет данных',
        'phase': 'Первая фаза'
    },
    7: {
        'film': 'Железный человек 3',
        'year': 2013,
        'director': 'Шейн Блэк',
        'screenwriter': 'Дрю Пирс и Шейн Блэк',
        'producer': 'Кевин Файги',
        'phase': 'Вторая фаза'
    },
    8: {
        'film': 'Тор 2: Царство тьмы',
        'year': 2013,
        'director': 'Алан Тейлор',
        'screenwriter': 'Кристофер Йост, Кристофер Маркус и Стивен Макфили',
        'producer': 'Нет данных',
        'phase': 'Вторая фаза'
    },
    9: {
        'film': 'Первый мститель: Другая война',
        'year': 2014,
        'director': 'Энтони и Джо Руссо',
        'screenwriter': 'Кристофер Маркус и Стивен Макфили',
        'producer': 'Нет данных',
        'phase': 'Вторая фаза'
    },
    10: {
        'film': 'Стражи Галактики',
        'year': 2014,
        'director': 'Джеймс Ганн',
        'screenwriter': 'Джеймс Ганн и Николь Перлман',
        'producer': 'Нет данных',
        'phase': 'Вторая фаза'
    },
    11: {
        'film': 'Мстители: Эра Альтрона',
        'year': 2015,
        'director': 'Джосс Уидон',
        'screenwriter': 'Нет данных',
        'producer': 'Нет данных',
        'phase': 'Вторая фаза'
    },
    12: {
        'film': 'Человек-муравей',
        'year': 2015,
        'director': 'Пейтон Рид',
        'screenwriter': 'Эдгар Райт и Джо Корниш, Адам Маккей и Пол Радд',
        'producer': 'Кевин Файги и Стивен Бруссар',
        'phase': 'Вторая фаза'
    },
    13: {
        'film': 'Первый мститель: Противостояние',
        'year': 2016,
        'director': 'Энтони и Джо Руссо',
        'screenwriter': 'Кристофер Маркус и Стивен Макфили',
        'producer': 'Кевин Файги',
        'phase': 'Третья фаза'
    },
    14: {
        'film': 'Доктор Стрэндж',
        'year': 2016,
        'director': 'Скотт Дерриксон',
        'screenwriter': 'Джон Спэйтс, Скотт Дерриксон и С. Роберт Каргилл',
        'producer': 'Кевин Файги',
        'phase': 'Третья фаза'
    },
    15: {
        'film': 'Стражи Галактики. Часть 2',
        'year': 2017,
        'director': 'Джеймс Ганн',
        'screenwriter': 'Нет данных',
        'producer': 'Нет данных',
        'phase': 'Третья фаза'
    },
    16: {
        'film': 'Человек-паук: Возвращение домой',
        'year': 2017,
        'director': 'Джон Уоттс',
        'screenwriter': 'Джонатан М. Голдштейн и Джон Френсис Дэйли, Джон Уоттс и Кристофер Форд, Крис МакКенна и Эрик Соммерс',
        'producer': 'Кевин Файги и Эми Паскаль',
        'phase': 'Третья фаза'
    },
    17: {
        'film': 'Тор: Рагнарёк',
        'year': 2017,
        'director': 'Тайка Вайтити',
        'screenwriter': 'Эрик Пирсон, Крэйг Кайл и Кристофер Йост',
        'producer': 'Кевин Файги',
        'phase': 'Третья фаза'
    },
    18: {
        'film': 'Чёрная пантера',
        'year': 2018,
        'director': 'Райан Куглер',
        'screenwriter': 'Райан Куглер и Джо Роберт Коул',
        'producer': 'Нет данных',
        'phase': 'Третья фаза'
    },
    19: {
        'film': 'Мстители: Война бесконечности',
        'year': 2018,
        'director': 'Энтони и Джо Руссо',
        'screenwriter': 'Кристофер Маркус и Стивен Макфили',
        'producer': 'Нет данных',
        'phase': 'Третья фаза'
    },
    20: {
        'film': 'Человек-муравей и Оса',
        'year': 2018,
        'director': 'Пейтон Рид',
        'screenwriter': 'Крис МакКенна и Эрик Соммерс; Пол Радд, Эндрю Баррер и Гэбриел Феррари',
        'producer': 'Кевин Файги и Стивен Бруссар',
        'phase': 'Третья фаза'
    },
    21: {
        'film': 'Капитан Марвел',
        'year': 2019,
        'director': 'Анна Боден и Райан Флек',
        'screenwriter': 'Женева Робертсон-Дуорет, Анна Боден и Райан Флек',
        'producer': 'Кевин Файги',
        'phase': 'Третья фаза'
    },
    22: {
        'film': 'Мстители: Финал',
        'year': 2019,
        'director': 'Энтони и Джо Руссо',
        'screenwriter': 'Кристофер Маркус и Стивен Макфили',
        'producer': 'Нет данных',
        'phase': 'Третья фаза'
    },
    23: {
        'film': 'Человек-паук: Вдали от дома',
        'year': 2019,
        'director': 'Джон Уоттс',
        'screenwriter': 'Крис МакКенна и Эрик Соммерс',
        'producer': 'Кевин Файги и Эми Паскаль',
        'phase': 'Третья фаза'
    },
    24: {
        'film': 'Чёрная вдова',
        'year': 2021,
        'director': 'Кейт Шортланд',
        'screenwriter': 'Эрик Пирсон',
        'producer': 'Кевин Файги',
        'phase': 'Четвёртая фаза'
    },
    25: {
        'film': 'Шан-Чи и легенда десяти колец',
        'year': 2021,
        'director': 'Дестин Дэниэл Креттон',
        'screenwriter': 'Дэвид Каллахэм & Дестин Дэниэл Креттон & Эндрю Лэнем',
        'producer': 'Кевин Файги и Джонатан Шварц',
        'phase': 'Четвёртая фаза'
    },
    26: {
        'film': 'Вечные',
        'year': 2021,
        'director': 'Хлоя Чжао',
        'screenwriter': 'Хлоя Чжао, Хлоя Чжао & Патрик Бёрли и Райан Фирпо & Каз Фирпо',
        'producer': 'Кевин Файги и Нейт Мур',
        'phase': 'Четвёртая фаза'
    },
    27: {
        'film': 'Человек-паук: Нет пути домой',
        'year': 2021,
        'director': 'Джон Уоттс',
        'screenwriter': 'Крис Маккенна & Эрик Соммерс',
        'producer': 'Кевин Файги и Эми Паскаль',
        'phase': 'Четвёртая фаза'
    },
    28: {
        'film': 'Доктор Стрэндж: В мультивселенной безумия',
        'year': 2022,
        'director': 'Сэм Рэйми',
        'screenwriter': 'Майкл Уолдрон',
        'producer': 'Кевин Файги',
        'phase': 'Четвёртая фаза'
    },
    29: {
        'film': 'Тор: Любовь и гром',
        'year': 2022,
        'director': 'Тайка Вайтити',
        'screenwriter': 'Тайка Вайтити и Дженнифер Кейтин Робинсон',
        'producer': 'Кевин Файги и Брэд Уиндербаум',
        'phase': 'Четвёртая фаза'
    },
    30: {
        'film': 'Чёрная пантера: Ваканда навеки',
        'year': 2022,
        'director': 'Райан Куглер',
        'screenwriter': 'Райан Куглер & Джо Роберт Коул',
        'producer': 'Кевин Файги и Нейт Мур',
        'phase': 'Четвёртая фаза'
    },
    31: {
        'film': 'Человек-муравей и Оса: Квантомания',
        'year': 2023,
        'director': 'Пейтон Рид',
        'screenwriter': 'Джефф Лавнесс',
        'producer': 'Кевин Файги и Стивен Бруссар',
        'phase': 'Пятая фаза'
    },
    32: {
        'film': 'Стражи Галактики. Часть 3',
        'year': 2023,
        'director': 'Джеймс Ганн',
        'screenwriter': 'Нет данных',
        'producer': 'Кевин Файги',
        'phase': 'Пятая фаза'
    },
    33: {
        'film': 'Капитан Марвел 2',
        'year': 2023,
        'director': 'Ниа Дакоста',
        'screenwriter': 'Меган Макдоннелл',
        'producer': 'Пост-продакшн',
        'phase': 'Пятая фаза'
    },
    34: {
        'film': 'Дэдпул 3',
        'year': 2024,
        'director': 'Шон Леви',
        'screenwriter': 'Ретт Риз, Пол Верник, Зеб Уэллс и Райан Рейнольдс',
        'producer': 'Кевин Файги, Райан Рейнольдс и Шон Леви',
        'phase': 'Пятая фаза'
    },
    35: {
        'film': 'Капитан Америка: Дивный новый мир',
        'year': 2024,
        'director': 'Джулиус Она',
        'screenwriter': 'Малкольм Спеллман и Далан Массон',
        'producer': 'Кевин Файги и Нейт Мур',
        'phase': 'Пятая фаза'
    },
    36: {
        'film': 'Громовержцы',
        'year': 2024,
        'director': 'Джейк Шрейер',
        'screenwriter': 'Эрик Пирсон',
        'producer': 'Кевин Файги',
        'phase': 'Пятая фаза'
    },
    37: {
        'film': 'Блэйд',
        'year': 2025,
        'director': 'Ян Деманж',
        'screenwriter': 'Майкл Старрбери и Ник Пиццолатто',
        'producer': 'Кевин Файги и Эрик Кэрролл',
        'phase': 'Пятая фаза'
    },
    38: {
        'film': 'Фантастическая четвёрка',
        'year': 2025,
        'director': 'Мэтт Шекман',
        'screenwriter': 'Джефф Каплан, Йен Спрингер и Джош Фридман',
        'producer': 'Кевин Файги',
        'phase': 'Шестая фаза'
    },
    39: {
        'film': 'Мстители: Династия Канга',
        'year': 2026,
        'director': 'Дестин Дэниэл Креттон',
        'screenwriter': 'Джефф Лавнесс',
        'producer': 'Кевин Файги и Джонатан Шварц',
        'phase': 'Шестая фаза'
    },
    40: {
        'film': 'Мстители: Секретные войны',
        'year': 2027,
        'director': 'TBA',
        'screenwriter': 'Майкл Уолдрон',
        'producer': 'Нет данных',
        'phase': 'Шестая фаза'
    },
    41: {
        'film': 'Войны в доспехах',
        'year': 'TBA',
        'director': 'TBA',
        'screenwriter': 'Яссер Лестер',
        'producer': 'Кевин Файги и Джонатан Шварц',
        'phase': 'Шестая фаза'
    }
}
